参考链接：https://www.kesci.com/home/project/5ddc974ef41512002cec1dca

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.25.3'

In [2]:
arr = [0, 1, 2, 3, 4]
df = pd.Series(arr)
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df = pd.Series(d)
df

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
dates = pd.date_range('today',periods=6) # 定义时间序列作为 index
num_arr = np.random.randn(6,4) # 传入 numpy 随机数组
columns = ['A','B','C','D'] # 将列表作为列名
df1 = pd.DataFrame(num_arr, index = dates, columns = columns)
df1

                                   A         B         C         D
2019-12-05 19:39:41.090280  0.796273  0.328756 -1.338852  1.245956
2019-12-06 19:39:41.090280 -0.439893 -0.547553 -2.372837  0.192831
2019-12-07 19:39:41.090280  0.884753 -0.524866 -0.011523  1.171110
2019-12-08 19:39:41.090280  0.419727 -1.822112  0.388700  0.267380
2019-12-09 19:39:41.090280  0.334324  0.811605  0.882096 -1.015146
2019-12-10 19:39:41.090280  1.202651 -1.143490 -0.250185  1.370709

In [5]:
dates = pd.date_range('today',periods=8) # 定义时间序列作为 index
dates

DatetimeIndex(['2019-12-05 19:39:41.108231', '2019-12-06 19:39:41.108231',
               '2019-12-07 19:39:41.108231', '2019-12-08 19:39:41.108231',
               '2019-12-09 19:39:41.108231', '2019-12-10 19:39:41.108231',
               '2019-12-11 19:39:41.108231', '2019-12-12 19:39:41.108231'],
              dtype='datetime64[ns]', freq='D')

In [6]:
# df = pd.read_csv('test.csv', encoding='gbk, sep=';')

In [7]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [8]:
# 方法一
# df.info()
# 方法二
# df.describe()

In [9]:
# integers location
df.iloc[:3]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

In [10]:
# location
df.loc[:, ["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [11]:
df.index[[3, 4, 8]]

Index(['d', 'e', 'i'], dtype='object')

In [12]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [13]:
df[df["age"]>3]

   age animal priority  visits
e  5.0    dog       no       2
g  4.5  snake       no       1
i  7.0    dog       no       2

In [14]:
df[df["age"].isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

In [15]:
df[(df["age"]>2) & (df["age"]<4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
j  3.0    dog       no       1

In [16]:
df.loc["f", "age"]=1.5
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [17]:
df["visits"].sum()

19

In [18]:
df["priority"].sum()

'yesyesnoyesnononoyesnono'

In [26]:
df.groupby('animal')['age'].mean()

animal
cat       2.333333
dog       5.000000
python    2.500000
Name: age, dtype: float64

In [27]:
df.groupby("animal")["age"].mean()

animal
cat       2.333333
dog       5.000000
python    2.500000
Name: age, dtype: float64

In [19]:
#插入
df.loc['k'] = [5.5, 'dog', 'no', 2]
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1
k  5.5    dog       no       2

In [20]:
# 删除
df = df.drop('k')
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

In [21]:
df["animal"].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [22]:
df.sort_values(by=["age", "visits"], ascending=[False, True])

   age animal priority  visits
i  7.0    dog       no       2
e  5.0    dog       no       2
g  4.5  snake       no       1
j  3.0    dog       no       1
b  3.0    cat      yes       3
a  2.5    cat      yes       1
f  1.5    cat       no       3
c  0.5  snake       no       2
h  NaN    cat      yes       1
d  NaN    dog      yes       3

In [23]:
df["priority"] = df["priority"].map({"yes": 1, "no": 0})  # 
df

   age animal  priority  visits
a  2.5    cat         1       1
b  3.0    cat         1       3
c  0.5  snake         0       2
d  NaN    dog         1       3
e  5.0    dog         0       2
f  1.5    cat         0       3
g  4.5  snake         0       1
h  NaN    cat         1       1
i  7.0    dog         0       2
j  3.0    dog         0       1

In [24]:
df["priority"] = df["priority"].map({1: True, 0: False})  # 
df

   age animal  priority  visits
a  2.5    cat      True       1
b  3.0    cat      True       3
c  0.5  snake     False       2
d  NaN    dog      True       3
e  5.0    dog     False       2
f  1.5    cat     False       3
g  4.5  snake     False       1
h  NaN    cat      True       1
i  7.0    dog     False       2
j  3.0    dog     False       1

In [25]:
df["animal"] = df["animal"].replace("snake", "python")
df

   age  animal  priority  visits
a  2.5     cat      True       1
b  3.0     cat      True       3
c  0.5  python     False       2
d  NaN     dog      True       3
e  5.0     dog     False       2
f  1.5     cat     False       3
g  4.5  python     False       1
h  NaN     cat      True       1
i  7.0     dog     False       2
j  3.0     dog     False       1

In [28]:
df.pivot_table(index="animal",columns="visits",values="age",aggfunc="mean")

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

In [37]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7, 1]})
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7
11  1

In [38]:
df['A'].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
11    7.0
Name: A, dtype: float64

In [39]:
df1 = df.loc[df['A'].shift() != df['A']]
df1

    A
0   1
1   2
3   3
4   4
5   5
8   6
9   7
11  1

In [40]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df1 = df.sub(df.mean(axis=1), axis=0)
print(df1)

          0         1         2
0  0.005654  0.038702  0.952739
1  0.787157  0.483608  0.701551
2  0.194755  0.293316  0.530129
3  0.655897  0.577958  0.789205
4  0.704824  0.512450  0.198026
          0         1         2
0 -0.326711 -0.293663  0.620374
1  0.129718 -0.173830  0.044112
2 -0.144645 -0.046084  0.190729
3 -0.018457 -0.096395  0.114852
4  0.233057  0.040684 -0.273741

In [42]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df1 = df.sub(-1, axis=0)
print(df1)

          0         1         2
0  0.947285  0.503182  0.474716
1  0.190828  0.146675  0.037047
2  0.423712  0.547846  0.814014
3  0.398728  0.685851  0.510183
4  0.841923  0.026934  0.698215
          0         1         2
0  1.947285  1.503182  1.474716
1  1.190828  1.146675  1.037047
2  1.423712  1.547846  1.814014
3  1.398728  1.685851  1.510183
4  1.841923  1.026934  1.698215

In [43]:
df = pd.DataFrame(np.random.random(size=(5, 5)), columns=list('abcde'))
print(df)
df.sum()

          a         b         c         d         e
0  0.473801  0.040367  0.369303  0.216019  0.984995
1  0.790960  0.274731  0.690257  0.073858  0.666702
2  0.078564  0.328971  0.355042  0.751172  0.546247
3  0.813943  0.700864  0.866833  0.436934  0.247616
4  0.258629  0.496643  0.468955  0.804324  0.016301

a    2.415896
b    1.841576
c    2.750389
d    2.282307
e    2.461860
dtype: float64

In [44]:
df.sum().idxmin()

'b'

In [45]:
df.median()

a    0.473801
b    0.328971
c    0.468955
d    0.436934
e    0.546247
dtype: float64

In [50]:
df = pd.DataFrame({'A': list('aaabbcaabcccbbc'), 
                   'B': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df)
df1 = df.groupby('A')['B'].nlargest(3).sum(level=0)
print(df1)

    A    B
0   a   12
1   a  345
2   a    3
3   b    1
4   b   45
5   c   14
6   a    4
7   a   52
8   b   54
9   c   23
10  c  235
11  c   21
12  b   57
13  b    3
14  c   87
A
a    409
b    156
c    345
Name: B, dtype: int64

In [51]:
df.groupby('A')['B'].sum()

A
a    416
b    160
c    380
Name: B, dtype: int64

In [52]:
df.groupby('A')['B'].nlargest(3).sum(level=0)

A
a    409
b    156
c    345
Name: B, dtype: int64

In [53]:
df = pd.DataFrame({'A': [1,2,11,11,33,34,35,40,79,99], 
                   'B': [1,2,11,11,33,34,35,40,79,99]})
df

    A   B
0   1   1
1   2   2
2  11  11
3  11  11
4  33  33
5  34  34
6  35  35
7  40  40
8  79  79
9  99  99

In [54]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]        3
(10, 20]      22
(20, 30]       0
(30, 40]     142
(40, 50]       0
(50, 60]       0
(60, 70]       0
(70, 80]      79
(80, 90]       0
(90, 100]     99
Name: B, dtype: int64

In [55]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].count()

A
(0, 10]      2
(10, 20]     2
(20, 30]     0
(30, 40]     4
(40, 50]     0
(50, 60]     0
(60, 70]     0
(70, 80]     1
(80, 90]     0
(90, 100]    1
Name: B, dtype: int64

In [56]:
# 28.给定DataFrame，计算每个元素至左边最近的0（或者至开头）的距离，生成新列y

df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

izero = np.r_[-1, (df['X'] == 0).to_numpy().nonzero()[0]] # 标记0的位置
idx = np.arange(len(df))
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]
print(df)

# 方法二
# x = (df['X'] != 0).cumsum()
# y = x != x.shift()
# df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()

# 方法三
# df['Y'] = df.groupby((df['X'] == 0).cumsum()).cumcount()
#first_zero_idx = (df['X'] == 0).idxmax()
# df['Y'].iloc[0:first_zero_idx] += 1

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

In [57]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
print(df)
df.unstack().sort_values()[-3:].index.tolist()

          0         1         2
0  0.793414  0.199231  0.604597
1  0.816861  0.246183  0.062789
2  0.263538  0.016728  0.343951
3  0.372701  0.514321  0.713578
4  0.755965  0.437984  0.749998

[(0, 4), (0, 0), (0, 1)]

In [58]:
df.unstack()

0  0    0.793414
   1    0.816861
   2    0.263538
   3    0.372701
   4    0.755965
1  0    0.199231
   1    0.246183
   2    0.016728
   3    0.514321
   4    0.437984
2  0    0.604597
   1    0.062789
   2    0.343951
   3    0.713578
   4    0.749998
dtype: float64

In [59]:
df.unstack().sort_values()

1  2    0.016728
2  1    0.062789
1  0    0.199231
   1    0.246183
0  2    0.263538
2  2    0.343951
0  3    0.372701
1  4    0.437984
   3    0.514321
2  0    0.604597
   3    0.713578
   4    0.749998
0  4    0.755965
   0    0.793414
   1    0.816861
dtype: float64

In [60]:
df.unstack().sort_values()[-3:]

0  4    0.755965
   0    0.793414
   1    0.816861
dtype: float64

In [61]:
df.unstack().sort_values()[-3:].index

MultiIndex([(0, 4),
            (0, 0),
            (0, 1)],
           )

In [62]:
df.unstack().sort_values()[-3:].index.tolist()

[(0, 4), (0, 0), (0, 1)]

In [63]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [-12,345,3,1,45,14,4,-52,54,23,-235,21,57,3,87]})

def replace(group):
    mask = group<0
    group[mask] = group[~mask].mean()
    return group

df

   grps  vals
0     a   -12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a   -52
8     b    54
9     c    23
10    c  -235
11    c    21
12    b    57
13    b     3
14    c    87

In [64]:
df.groupby(['grps'])['vals'].mean()

grps
a    57.6
b    32.0
c   -18.0
Name: vals, dtype: float64

In [65]:
df['vals_new'] = df.groupby(['grps'])['vals'].transform(replace)
df

   grps  vals    vals_new
0     a   -12  117.333333
1     a   345  345.000000
2     a     3    3.000000
3     b     1    1.000000
4     b    45   45.000000
5     c    14   14.000000
6     a     4    4.000000
7     a   -52  117.333333
8     b    54   54.000000
9     c    23   23.000000
10    c  -235   36.250000
11    c    21   21.000000
12    b    57   57.000000
13    b     3    3.000000
14    c    87   87.000000

In [66]:
# 31.计算3位滑动窗口的平均值，忽略NAN


# df = pd.DataFrame({'group': list('aabbabbbabab'),
#                     'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
# print(df)

# g1 = df.groupby(['group'])['value']
# g2 = df.fillna(0).groupby(['group'])['value'] 

# s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count()

# s.reset_index(level=0, drop=True).sort_index()